## Plan Result (prod_global)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 105 to add, 0 to change, 105 to destroy.</code></pre>

* Create
  * module.landing_zone[0].azurerm_frontdoor.main
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;adoption&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;cft-api-mgmt&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;cmc&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;cmc-legal&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;div-amend&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;div-da&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;div-dn&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;div-pfe&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;div-rfe&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;dtsse-ardoq-adapter&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;et-pet&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;et-response-pet&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;et-staff-pet&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;et-sya&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;fact&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;fact-admin&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;fact-redirect&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;fees-register&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;gateway-ccd&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;hmi-apim&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;hwf-pet&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;hwf-staff-pet&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;ia-aip&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;idam-user-dashboard&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;idam-web-admin&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;idam-web-public&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;jui-redirect&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;lau&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;manage-payments&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;nfdiv-civil-partnership&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;paybubble&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;payment-outcome&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;pcq&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;plum&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;private-law&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;probate&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;reformscan&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;response&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;return-case-doc-ccd&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;sandbox-build&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;sptribs-frontend&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;sscs-cor&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;sscs-tribunals&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;sscs-tya&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;tt-pet&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;xui-approve-org&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;xui-manage-org&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;xui-register-org&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;xui-webapp&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https_www_redirect[&#34;et-pet&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https_www_redirect[&#34;fees-register&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https_www_redirect[&#34;manage-payments&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https_www_redirect[&#34;paybubble&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https_www_redirect[&#34;payment-outcome&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;adoption&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;cft-api-mgmt&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;cmc&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;cmc-legal&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;div-amend&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;div-da&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;div-dn&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;div-pfe&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;div-rfe&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;dtsse-ardoq-adapter&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;et-pet&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;et-response-pet&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;et-staff-pet&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;et-sya&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;fact&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;fact-admin&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;fact-redirect&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;fees-register&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;gateway-ccd&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;hmi-apim&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;hwf-pet&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;hwf-staff-pet&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;ia-aip&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;idam-user-dashboard&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;idam-web-admin&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;idam-web-public&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;jui-redirect&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;lau&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;manage-payments&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;nfdiv-civil-partnership&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;paybubble&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;payment-outcome&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;pcq&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;plum&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;private-law&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;probate&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;reformscan&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;return-case-doc-ccd&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;sptribs-frontend&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;sscs-cor&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;sscs-tribunals&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;sscs-tya&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;tt-pet&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;xui-approve-org&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;xui-manage-org&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;xui-register-org&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;xui-webapp&#34;]
  * module.landing_zone[0].azurerm_key_vault_access_policy.frontdoor_kv_access[0]
  * module.landing_zone[0].azurerm_monitor_diagnostic_setting.frontdoor_diagnostics
  * module.landing_zone[0].azurerm_role_assignment.frontdoor_kv_access[0]
* Delete
  * module.landing_zone.azurerm_frontdoor.main
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;adoption&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;cft-api-mgmt&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;cmc&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;cmc-legal&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;div-amend&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;div-da&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;div-dn&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;div-pfe&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;div-rfe&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;dtsse-ardoq-adapter&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;et-pet&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;et-response-pet&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;et-staff-pet&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;et-sya&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;fact&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;fact-admin&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;fact-redirect&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;fees-register&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;gateway-ccd&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;hmi-apim&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;hwf-pet&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;hwf-staff-pet&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;ia-aip&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;idam-user-dashboard&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;idam-web-admin&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;idam-web-public&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;jui-redirect&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;lau&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;manage-payments&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;nfdiv-civil-partnership&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;paybubble&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;payment-outcome&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;pcq&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;plum&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;private-law&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;probate&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;reformscan&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;response&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;return-case-doc-ccd&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;sandbox-build&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;sptribs-frontend&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;sscs-cor&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;sscs-tribunals&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;sscs-tya&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;tt-pet&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;xui-approve-org&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;xui-manage-org&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;xui-register-org&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;xui-webapp&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https_www_redirect[&#34;et-pet&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https_www_redirect[&#34;fees-register&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https_www_redirect[&#34;manage-payments&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https_www_redirect[&#34;paybubble&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https_www_redirect[&#34;payment-outcome&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;adoption&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;cft-api-mgmt&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;cmc&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;cmc-legal&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;div-amend&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;div-da&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;div-dn&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;div-pfe&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;div-rfe&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;dtsse-ardoq-adapter&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;et-pet&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;et-response-pet&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;et-staff-pet&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;et-sya&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;fact&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;fact-admin&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;fact-redirect&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;fees-register&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;gateway-ccd&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;hmi-apim&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;hwf-pet&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;hwf-staff-pet&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;ia-aip&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;idam-user-dashboard&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;idam-web-admin&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;idam-web-public&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;jui-redirect&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;lau&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;manage-payments&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;nfdiv-civil-partnership&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;paybubble&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;payment-outcome&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;pcq&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;plum&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;private-law&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;probate&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;reformscan&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;return-case-doc-ccd&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;sptribs-frontend&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;sscs-cor&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;sscs-tribunals&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;sscs-tya&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;tt-pet&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;xui-approve-org&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;xui-manage-org&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;xui-register-org&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;xui-webapp&#34;]
  * module.landing_zone.azurerm_key_vault_access_policy.frontdoor_kv_access[0]
  * module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics
  * module.landing_zone.azurerm_role_assignment.frontdoor_kv_access[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.landing_zone.azurerm_frontdoor.main will be destroyed
  # (because module.landing_zone is not in configuration)
  - resource "azurerm_frontdoor" "main" {
      - backend_pool_health_probes           = {
          - "defaultHealthProbe"                          = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/healthProbeSettings/defaultHealthProbe"
          - "healthProbeSettings-adoption"                = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/healthProbeSettings/healthProbeSettings-adoption"
          - "healthProbeSettings-cft-api-mgmt"            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/healthProbeSettings/healthProbeSettings-cft-api-mgmt"
          - "healthProbeSettings-cmc"                     = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/healthProbeSettings/healthProbeSettings-cmc"
          - "healthProbeSettings-cmc-legal"               = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/healthProbeSettings/healthProbeSettings-cmc-legal"
          - "healthProbeSettings-div-amend"               = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/healthProbeSettings/healthProbeSettings-div-amend"
          - "healthProbeSettings-div-da"                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/healthProbeSettings/healthProbeSettings-div-da"
          - "healthProbeSettings-div-dn"                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/healthProbeSettings/healthProbeSettings-div-dn"
          - "healthProbeSettings-div-pfe"                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/healthProbeSettings/healthProbeSettings-div-pfe"
          - "healthProbeSettings-div-rfe"                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/healthProbeSettings/healthProbeSettings-div-rfe"
          - "healthProbeSettings-dtsse-ardoq-adapter"     = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/healthProbeSettings/healthProbeSettings-dtsse-ardoq-adapter"
          - "healthProbeSettings-et-pet"                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/healthProbeSettings/healthProbeSettings-et-pet"
          - "healthProbeSettings-et-response-pet"         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/healthProbeSettings/healthProbeSettings-et-response-pet"
          - "healthProbeSettings-et-staff-pet"            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/healthProbeSettings/healthProbeSettings-et-staff-pet"
          - "healthProbeSettings-et-sya"                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/healthProbeSettings/healthProbeSettings-et-sya"
          - "healthProbeSettings-fact"                    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/healthProbeSettings/healthProbeSettings-fact"
          - "healthProbeSettings-fact-admin"              = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/healthProbeSettings/healthProbeSettings-fact-admin"
          - "healthProbeSettings-fact-redirect"           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/healthProbeSettings/healthProbeSettings-fact-redirect"
          - "healthProbeSettings-fees-register"           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/healthProbeSettings/healthProbeSettings-fees-register"
          - "healthProbeSettings-gateway-ccd"             = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/healthProbeSettings/healthProbeSettings-gateway-ccd"
          - "healthProbeSettings-hmi-apim"                = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/healthProbeSettings/healthProbeSettings-hmi-apim"
          - "healthProbeSettings-hwf-pet"                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/healthProbeSettings/healthProbeSettings-hwf-pet"
          - "healthProbeSettings-hwf-staff-pet"           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/healthProbeSettings/healthProbeSettings-hwf-staff-pet"
          - "healthProbeSettings-ia-aip"                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/healthProbeSettings/healthProbeSettings-ia-aip"
          - "healthProbeSettings-idam-user-dashboard"     = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/healthProbeSettings/healthProbeSettings-idam-user-dashboard"
          - "healthProbeSettings-idam-web-admin"          = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/healthProbeSettings/healthProbeSettings-idam-web-admin"
          - "healthProbeSettings-idam-web-public"         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/healthProbeSettings/healthProbeSettings-idam-web-public"
          - "healthProbeSettings-jui-redirect"            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/healthProbeSettings/healthProbeSettings-jui-redirect"
          - "healthProbeSettings-lau"                     = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/healthProbeSettings/healthProbeSettings-lau"
          - "healthProbeSettings-manage-payments"         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/healthProbeSettings/healthProbeSettings-manage-payments"
          - "healthProbeSettings-nfdiv-civil-partnership" = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/healthProbeSettings/healthProbeSettings-nfdiv-civil-partnership"
          - "healthProbeSettings-paybubble"               = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/healthProbeSettings/healthProbeSettings-paybubble"
          - "healthProbeSettings-payment-outcome"         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/healthProbeSettings/healthProbeSettings-payment-outcome"
          - "healthProbeSettings-pcq"                     = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/healthProbeSettings/healthProbeSettings-pcq"
          - "healthProbeSettings-plum"                    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/healthProbeSettings/healthProbeSettings-plum"
          - "healthProbeSettings-private-law"             = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/healthProbeSettings/healthProbeSettings-private-law"
          - "healthProbeSettings-probate"                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/healthProbeSettings/healthProbeSettings-probate"
          - "healthProbeSettings-reformscan"              = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/healthProbeSettings/healthProbeSettings-reformscan"
          - "healthProbeSettings-return-case-doc-ccd"     = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/healthProbeSettings/healthProbeSettings-return-case-doc-ccd"
          - "healthProbeSettings-sptribs-frontend"        = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/healthProbeSettings/healthProbeSettings-sptribs-frontend"
          - "healthProbeSettings-sscs-cor"                = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/healthProbeSettings/healthProbeSettings-sscs-cor"
          - "healthProbeSettings-sscs-tribunals"          = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/healthProbeSettings/healthProbeSettings-sscs-tribunals"
          - "healthProbeSettings-sscs-tya"                = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/healthProbeSettings/healthProbeSettings-sscs-tya"
          - "healthProbeSettings-tt-pet"                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/healthProbeSettings/healthProbeSettings-tt-pet"
          - "healthProbeSettings-xui-approve-org"         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/healthProbeSettings/healthProbeSettings-xui-approve-org"
          - "healthProbeSettings-xui-manage-org"          = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/healthProbeSettings/healthProbeSettings-xui-manage-org"
          - "healthProbeSettings-xui-register-org"        = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/healthProbeSettings/healthProbeSettings-xui-register-org"
          - "healthProbeSettings-xui-webapp"              = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/healthProbeSettings/healthProbeSettings-xui-webapp"
        } -> null
      - backend_pool_load_balancing_settings = {
          - "defaultLoadBalancing"                          = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/loadBalancingSettings/defaultLoadBalancing"
          - "loadBalancingSettings-adoption"                = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/loadBalancingSettings/loadBalancingSettings-adoption"
          - "loadBalancingSettings-cft-api-mgmt"            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/loadBalancingSettings/loadBalancingSettings-cft-api-mgmt"
          - "loadBalancingSettings-cmc"                     = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/loadBalancingSettings/loadBalancingSettings-cmc"
          - "loadBalancingSettings-cmc-legal"               = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/loadBalancingSettings/loadBalancingSettings-cmc-legal"
          - "loadBalancingSettings-div-amend"               = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/loadBalancingSettings/loadBalancingSettings-div-amend"
          - "loadBalancingSettings-div-da"                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/loadBalancingSettings/loadBalancingSettings-div-da"
          - "loadBalancingSettings-div-dn"                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/loadBalancingSettings/loadBalancingSettings-div-dn"
          - "loadBalancingSettings-div-pfe"                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/loadBalancingSettings/loadBalancingSettings-div-pfe"
          - "loadBalancingSettings-div-rfe"                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/loadBalancingSettings/loadBalancingSettings-div-rfe"
          - "loadBalancingSettings-dtsse-ardoq-adapter"     = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/loadBalancingSettings/loadBalancingSettings-dtsse-ardoq-adapter"
          - "loadBalancingSettings-et-pet"                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/loadBalancingSettings/loadBalancingSettings-et-pet"
          - "loadBalancingSettings-et-response-pet"         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/loadBalancingSettings/loadBalancingSettings-et-response-pet"
          - "loadBalancingSettings-et-staff-pet"            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/loadBalancingSettings/loadBalancingSettings-et-staff-pet"
          - "loadBalancingSettings-et-sya"                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/loadBalancingSettings/loadBalancingSettings-et-sya"
          - "loadBalancingSettings-fact"                    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/loadBalancingSettings/loadBalancingSettings-fact"
          - "loadBalancingSettings-fact-admin"              = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/loadBalancingSettings/loadBalancingSettings-fact-admin"
          - "loadBalancingSettings-fact-redirect"           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/loadBalancingSettings/loadBalancingSettings-fact-redirect"
          - "loadBalancingSettings-fees-register"           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/loadBalancingSettings/loadBalancingSettings-fees-register"
          - "loadBalancingSettings-gateway-ccd"             = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/loadBalancingSettings/loadBalancingSettings-gateway-ccd"
          - "loadBalancingSettings-hmi-apim"                = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/loadBalancingSettings/loadBalancingSettings-hmi-apim"
          - "loadBalancingSettings-hwf-pet"                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/loadBalancingSettings/loadBalancingSettings-hwf-pet"
          - "loadBalancingSettings-hwf-staff-pet"           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/loadBalancingSettings/loadBalancingSettings-hwf-staff-pet"
          - "loadBalancingSettings-ia-aip"                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/loadBalancingSettings/loadBalancingSettings-ia-aip"
          - "loadBalancingSettings-idam-user-dashboard"     = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/loadBalancingSettings/loadBalancingSettings-idam-user-dashboard"
          - "loadBalancingSettings-idam-web-admin"          = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/loadBalancingSettings/loadBalancingSettings-idam-web-admin"
          - "loadBalancingSettings-idam-web-public"         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/loadBalancingSettings/loadBalancingSettings-idam-web-public"
          - "loadBalancingSettings-jui-redirect"            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/loadBalancingSettings/loadBalancingSettings-jui-redirect"
          - "loadBalancingSettings-lau"                     = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/loadBalancingSettings/loadBalancingSettings-lau"
          - "loadBalancingSettings-manage-payments"         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/loadBalancingSettings/loadBalancingSettings-manage-payments"
          - "loadBalancingSettings-nfdiv-civil-partnership" = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/loadBalancingSettings/loadBalancingSettings-nfdiv-civil-partnership"
          - "loadBalancingSettings-paybubble"               = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/loadBalancingSettings/loadBalancingSettings-paybubble"
          - "loadBalancingSettings-payment-outcome"         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/loadBalancingSettings/loadBalancingSettings

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

0"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942361"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942380"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942400"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942440"
                }
            }
        }
    }

  # module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom["tt-pet"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "ttpetprod"
      + resource_group_name   = "lz-prod-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_tax-tribunals-datacapture_session"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "cookie_setting"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_utma"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_utmb"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_utmc"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_utmz"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_ga"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "authenticity_token"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "address_lookup_url"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "StartsWith"
              + selector       = "steps_closure_support_documents_form"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "StartsWith"
              + selector       = "steps_details_documents_upload_form"
            }
        }
    }

  # module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom["xui-approve-org"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Detection"
      + name                  = "xuiapproveorgprod"
      + resource_group_name   = "lz-prod-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "dtSa"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "iss"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "__auth__"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "xui-approve-org"
            }

          + override {
              + rule_group_name = "SQLI"

              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942100"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942150"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942200"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942210"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942230"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942361"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942380"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942400"
                }
            }
        }
    }

  # module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom["xui-manage-org"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Detection"
      + name                  = "xuimanageorgprod"
      + resource_group_name   = "lz-prod-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + custom_rule {
          + action                         = "Allow"
          + enabled                        = true
          + name                           = "RumBeaconExclusion"
          + priority                       = 100
          + rate_limit_duration_in_minutes = 1
          + rate_limit_threshold           = 10
          + type                           = "MatchRule"

          + match_condition {
              + match_values       = [
                  + "POST",
                ]
              + match_variable     = "RequestMethod"
              + negation_condition = false
              + operator           = "Equal"
            }
          + match_condition {
              + match_values       = [
                  + "/rb_",
                ]
              + match_variable     = "RequestUri"
              + negation_condition = false
              + operator           = "Contains"
            }
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "dtSa"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "iss"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "__auth__"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "xui-manage-org"
            }

          + override {
              + rule_group_name = "SQLI"

              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942100"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942150"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942200"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942210"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942230"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942361"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942380"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942400"
                }
            }
        }
    }

  # module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom["xui-register-org"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Detection"
      + name                  = "xuiregisterorgprod"
      + resource_group_name   = "lz-prod-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "dtSa"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "iss"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "__auth__"
            }

          + override {
              + rule_group_name = "SQLI"

              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942100"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942150"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942200"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942210"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942230"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942361"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942380"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942400"
                }
            }
        }
    }

  # module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom["xui-webapp"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Detection"
      + name                  = "xuiwebappprod"
      + resource_group_name   = "lz-prod-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + custom_rule {
          + action                         = "Allow"
          + enabled                        = true
          + name                           = "RumBeaconExclusion"
          + priority                       = 100
          + rate_limit_duration_in_minutes = 1
          + rate_limit_threshold           = 10
          + type                           = "MatchRule"

          + match_condition {
              + match_values       = [
                  + "POST",
                ]
              + match_variable     = "RequestMethod"
              + negation_condition = false
              + operator           = "Equal"
            }
          + match_condition {
              + match_values       = [
                  + "/rb_",
                ]
              + match_variable     = "RequestUri"
              + negation_condition = false
              + operator           = "Contains"
            }
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "dtSa"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "iss"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "__auth__"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "xui-webapp"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "rf"
            }

          + override {
              + rule_group_name = "SQLI"

              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942100"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942150"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942200"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942210"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942230"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942361"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942380"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942390"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942400"
                }
            }
        }
    }

  # module.landing_zone[0].azurerm_key_vault_access_policy.frontdoor_kv_access[0] will be created
  + resource "azurerm_key_vault_access_policy" "frontdoor_kv_access" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-platform-prod-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappsprod"
      + object_id               = "0a7e9367-4349-4b24-974a-bfa7b23a38fc"
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.landing_zone[0].azurerm_monitor_diagnostic_setting.frontdoor_diagnostics will be created
  + resource "azurerm_monitor_diagnostic_setting" "frontdoor_diagnostics" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-prod"
      + name                           = "fd-log-analytics"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "FrontdoorAccessLog"

          + retention_policy {
              + days    = 7
              + enabled = true
            }
        }
      + enabled_log {
          + category = "FrontdoorWebApplicationFirewallLog"

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }
    }

  # module.landing_zone[0].azurerm_role_assignment.frontdoor_kv_access[0] will be created
  + resource "azurerm_role_assignment" "frontdoor_kv_access" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0a7e9367-4349-4b24-974a-bfa7b23a38fc"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-platform-prod-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappsprod"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 105 to add, 0 to change, 105 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1776,"Program":"tfcmt","SHA1":"","Target":"prod_global","Vars":{}} -->